ka2_2024/src/Documents/ФинОтчетВБанк/ФинОтчетВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФинОтчетВБанк</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.БанкиУниверсальногоОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКомплекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставлениеКомплекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доверенность</name>
    <type>
      <types>DefinedType.МЧДУниверсальныйОбменСБанками</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭкономическиеСубъекты</name>
    <attributes>
      <name>КлючСтрокиСубъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субъект</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключатьОбособленныеПодразделения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отчетность</name>
    <attributes>
      <name>КлючСтрокиОтчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтрокиСубъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>254</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиКомплекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетСсылка</name>
      <type>
        <types>DocumentRef.РегламентированныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлОтчета</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеНаименования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <comment>Дата окончания</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлОтчетаСодержитЭП</name>
      <comment>Истина, если ФайлОтчета содержит ссылку на присоединный zip-архив, внутри которого есть в том числе файлы электронных подписей</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияДанныхОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОтсутствуют</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяКорректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяНастройка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженоИзВнешнегоФайла</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлОтчетаXML</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DefinedType.МЧДУниверсальныйОбменСБанками</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОтчетов</name>
    <attributes>
      <name>КлючСтрокиОтчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ПараметрФинОтчетаВБанк</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСистемыНалогообложения</name>
    <comment>Заполняются при загрузке пакетов отчетности других компаний группы, которые ведут учет в собственных базах 1С:Бухгалтерии</comment>
    <attributes>
      <name>КлючСтрокиСубъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СистемаНалогообложения</name>
      <type>
        <types>EnumRef.СистемыНалогообложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяУСНДоходы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяУСНДоходыМинусРасходы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлательщикЕНВД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяУСНПатент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлательщикТорговогоСбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяНалогНаПрофессиональныйДоход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/CommonModules/ЗаполнениеФинОтчетностиВБанкиКлиент/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область РегламентированнаяОтчетность

Процедура ОткрытьФормуВыбораРегламентированногоОтчета(ПараметрыФормы, ВладелецФормы, ОписаниеОповещенияОЗакрытии) Экспорт

	ОткрытьФорму("ОбщаяФорма.ВыборРегламентированногоОтчета",
		ПараметрыФормы, ВладелецФормы, , , , ОписаниеОповещенияОЗакрытии);
		
КонецПроцедуры

#КонецОбласти

Процедура ОбновлениеФинОтчетностиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("Ключ") Тогда
		// Открывается форма существующего комплекта.
		ОткрытьФорму("Документ.ФинОтчетВБанк.ФормаОбъекта", ДополнительныеПараметры);
	Иначе
		// Открывается форма нового комплекта.
		ЭтоАрхивныйКомплект = ЗаполнениеФинОтчетностиВБанкиВызовСервера.ЭтоАрхивныйКомплект(
			ДополнительныеПараметры.ЗначенияЗаполнения.Банк,
			ДополнительныеПараметры.ЗначенияЗаполнения.ИдентификаторКомплекта);
		
		Если ЭтоАрхивныйКомплект Тогда
			ЗаполнениеФинОтчетностиВБанкиВызовСервера.ЗакончитьВыполнениеПравила(ДополнительныеПараметры.Правило);
			
			ЗначенияЗаполнения = Новый Структура("Организация, Банк, НачалоПериода, КонецПериода");
			ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, ДополнительныеПараметры.ЗначенияЗаполнения);
			ОбработчикОповещения = Новый ОписаниеОповещения("ПредупреждениеЗакрытие", ЭтотОбъект, ЗначенияЗаполнения);
			
			ПоказатьПредупреждение(ОбработчикОповещения,
				НСтр("ru = 'Выбранный комплект 1С:ФинОтчетности находится в архиве.
				|Выберите другой комплект.'"));
		Иначе
			ОткрытьФорму("Документ.ФинОтчетВБанк.ФормаОбъекта", ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму со ссылками на инструкции по работе с электронными подписями.
//
// Параметры:
//  Владелец     - ФормаКлиентскогоПриложения - из какого контекста открываются инструкции.
//  ПараметрыИнструкций - Структура - скрывает или отображает отдельные ссылки.
//
Процедура ОткрытьИнструкциюПолученияЭП(Владелец, ПараметрыИнструкций) Экспорт
	
	ОткрытьФорму("Документ.ФинОтчетВБанк.Форма.ИнструкцияПоРаботеСЭП", ПараметрыИнструкций, Владелец,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПредупреждениеЗакрытие(ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.Форма.ФормаСозданияНовогоОтчета", ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
